      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ShortestProgram.

       PROCEDURE DIVISION.
       Display-Prompt.
            DISPLAY "Hello world! This is the shortest program."
            STOP RUN.
       END PROGRAM ShortestProgram.
